// Lab_03_2.cpp
// Строган Анастасія
// Лабораторна робота № 3.2
// Розгалуження, задане формулою: функція з параметрами.
// Варіант 16
#include <iostream>
using namespace std;

int main() {
    double x;  // вхідний аргумент
    double a;  // вхідний параметр
    double b;  // вхідний параметр
    double c;  // вхідний параметр
    double F;  // результат обчислення виразу

    // Введення значень
    cout << "a = "; cin >> a;
    cout << "b = "; cin >> b;
    cout << "c = "; cin >> c;
    cout << "x = "; cin >> x;

    // Спосіб 1: розгалуження в скороченій формі
    if (x == 0 && b != 0) {
        F = (a * (x + c) * (x + c)) - b;
    }
    if (x == 0 && b == 0) {
        F = -c;
    }
    if (!(x == 0 && b != 0) && !(x == 0 && b == 0)) {
        F = a + (x / c);
    }
    cout << "1) F = " << F << endl;

    // Спосіб 2: розгалуження в повній формі
    if (x == 0 && b != 0) {
        F = (a * (x + c) * (x + c)) - b;
    }
    else if (x == 0 && b == 0) {
        F = -c;
    }
    else {
        F = a + (x / c);
    }
    cout << "2) F = " << F << endl;

    return 0;
}
